# Pandas

Handling the data or data manipulation

In [1]:
import numpy as np
import pandas as pd

In [2]:
ar = np.array([1,4,5,7,8])
ar

array([1, 4, 5, 7, 8])

In [3]:
p1=pd.Series(ar)
p1

0    1
1    4
2    5
3    7
4    8
dtype: int32

In [4]:
p1.index=["A","B", "C", "D", "E"]

In [5]:
p1

A    1
B    4
C    5
D    7
E    8
dtype: int32

In [6]:
type(p1)

pandas.core.series.Series

In [7]:
# create panda series data4
s1=pd.Series([75,85,95,45,65],index=["Kohli","Rohit","Pant","Dhoni","Rahul"])
s1

Kohli    75
Rohit    85
Pant     95
Dhoni    45
Rahul    65
dtype: int64

In [8]:
s1.iloc[2]

95

In [9]:
s1.iloc[0:4]

Kohli    75
Rohit    85
Pant     95
Dhoni    45
dtype: int64

In [10]:
s1.loc["Dhoni"]

45

In [11]:
s1.loc["Kohli":"Dhoni"]

Kohli    75
Rohit    85
Pant     95
Dhoni    45
dtype: int64

In [12]:
p2=pd.Series([5,90,45,3,95])
p2

0     5
1    90
2    45
3     3
4    95
dtype: int64

In [13]:
p2.loc["0":"2"]  # p2.loc[0:2]  -- labels and not index

0     5
1    90
2    45
dtype: int64

In [14]:
p2.iloc[0:3]  # this is index and end is exclusive

0     5
1    90
2    45
dtype: int64

In [15]:
# vectorization
s1=pd.Series([5,7,3,6,9],index=["A","B","C","D","E"])
s2=pd.Series([8,89,34,67,22],index=["A","B","C","D","E"])
s1+s2

A    13
B    96
C    37
D    73
E    31
dtype: int64

if label changes, it gives NAN--- null value

# Pandas Dataframe--- 2D (Table Data)

In [16]:
# Dictionary
data=pd.DataFrame({"Name":["John","Raja","Krish","George"], "Age":[35,32,67,54],"country":["US","UK","India","Australia"]})
data

     Name  Age    country
0    John   35         US
1    Raja   32         UK
2   Krish   67      India
3  George   54  Australia

In [17]:
# lists
data1=pd.DataFrame([["John",35,"US"],["Raja",32,"UK"],["Krish",67,"Australia"]],columns=["Name","Age","Country"])
data1

    Name  Age    Country
0   John   35         US
1   Raja   32         UK
2  Krish   67  Australia

In [18]:
type(data)

pandas.core.frame.DataFrame

In [19]:
data["Name"]

0      John
1      Raja
2     Krish
3    George
Name: Name, dtype: object

In [20]:
type(data)

pandas.core.frame.DataFrame

In [21]:
data.loc[[0,1],["Name","Age"]]

   Name  Age
0  John   35
1  Raja   32

In [22]:
data

     Name  Age    country
0    John   35         US
1    Raja   32         UK
2   Krish   67      India
3  George   54  Australia

In [23]:
data.loc[[0,2],["Name","country"]]

    Name country
0   John      US
2  Krish   India

In [24]:
data.loc[0:2,"Name":"country"]

    Name  Age country
0   John   35      US
1   Raja   32      UK
2  Krish   67   India

In [25]:
data

     Name  Age    country
0    John   35         US
1    Raja   32         UK
2   Krish   67      India
3  George   54  Australia

In [26]:
# index positions
data.iloc[0:2,0:2]

   Name  Age
0  John   35
1  Raja   32

In [27]:
data

     Name  Age    country
0    John   35         US
1    Raja   32         UK
2   Krish   67      India
3  George   54  Australia

In [28]:
# not continuous so use comma in a list
data.iloc[[0,2],[0,2]]

    Name country
0   John      US
2  Krish   India

In [29]:
data

     Name  Age    country
0    John   35         US
1    Raja   32         UK
2   Krish   67      India
3  George   54  Australia

In [30]:
data["Marital Status"]=["Y", "N","Y","Y"]

In [31]:
data

     Name  Age    country Marital Status
0    John   35         US              Y
1    Raja   32         UK              N
2   Krish   67      India              Y
3  George   54  Australia              Y

In [32]:
data.iloc[[1,3],[0,3]]

     Name Marital Status
1    Raja              N
3  George              Y

In [33]:
data.loc[[1,3],["Name","Marital Status"]]

     Name Marital Status
1    Raja              N
3  George              Y